# 1.CREATE TABLE

In [1]:
import sqlite3

In [9]:
conn=sqlite3.connect('ESM1.db')

In [10]:
create="create table IF NOT EXISTS employee6(Eid int PRIMARY KEY,Name text,Dept text,Basic int,Branch test)"

In [11]:
cur=conn.cursor()

In [12]:
cur.execute(create)

In [13]:
conn.commit()

# 2.INSERT FIVE RECORDS

  INSERT FIVE RECORDS DIRECTLY

In [14]:
in1="insert into employee6 values(1,'keshav','it',6000,'surat'),(2,'madhav','account',4000,'bardoli'),(3,'krish','hr',6200,'bombay'),(4,'krishna','inventory',7000,'chennai'),(5,'radha','it',5600,'ahemdabad')"

In [15]:
cur.execute(in1)

  INSERT RECORD USING TUPLE

In [16]:
in2="insert into employee6 values(?,?,?,?,?)"

In [17]:
t=[(6,'kunj','hr',9000,'navsari'),(7,'radha','it',11000,'delhi'),(8,'kunj','hr',9000,'navsari'),(9,'prathna','inventory',9900,'bilimora'),(10,'gopi','account',4000,'vapi')]

In [18]:
cur=conn.cursor()

In [19]:
cur.executemany(in2,t)

INSERT RECORD USING TAKING INPUT FROM USER

In [20]:
in3="insert into employee6 values(?,?,?,?,?)"

In [25]:
l=[]

In [27]:
for i in range(5):
    n=int(input("enter id:"))
    nm=input("enter name:")
    d=input("enter dep:")
    s=int(input("enter salary:"))
    b=input("enter branch:")
    t2=(n,nm,d,s,b)
    l.append(t2)

enter id:11
enter name:jamna
enter dep:hr
enter salary:5000
enter branch:bharuch
enter id:12
enter name:kisha
enter dep:account
enter salary:3900
enter branch:ahemdabad
enter id:13
enter name:lila
enter dep:hr
enter salary:11000
enter branch:vadodra
enter id:14
enter name:jal
enter dep:it
enter salary:7800
enter branch:vapi
enter id:15
enter name:kinjal
enter dep:it
enter salary:20000
enter branch:surat

In [28]:
cur.executemany(in3,l)

In [33]:
conn.commit()

# 3.UPDATE RECORDS WHO ARE FROME "SURAT" BRANCH INCREMENT IN SALARY 10%.

In [55]:
d1="update employee6 set basic=basic+(basic*10\100) where branch='surat'"

In [56]:
cur=conn.cursor()

In [57]:
cur.execute(d1)

OperationalError: unrecognized token: "@"

In [59]:
conn.commit()

# 4.PRINT ALL RECORDS

In [60]:
S="select * from employee6"

In [62]:
cur.execute(S)

In [63]:
import pandas as pd

In [66]:
pd.DataFrame(cur.fetchall())

     0        1          2      3          4
0    1   keshav         it   6000      surat
1    2   madhav    account   4000    bardoli
2    3    krish         hr   6200     bombay
3    4  krishna  inventory   7000    chennai
4    5    radha         it   5600  ahemdabad
5    6     kunj         hr   9000    navsari
6    7    radha         it  11000      delhi
7    8     kunj         hr   9000    navsari
8    9  prathna  inventory   9900   bilimora
9   10     gopi    account   4000       vapi
10  11    jamna         hr   5000    bharuch
11  12    kisha    account   3900  ahemdabad
12  13     lila         hr  11000    vadodra
13  14      jal         it   7800       vapi
14  15   kinjal         it  20000      surat

In [69]:
q1="select * from employee6 where dept in('hr','it') "

In [70]:
cur.execute(q1)

In [71]:
pd.DataFrame(cur.fetchall())

    0       1   2      3          4
0   1  keshav  it   6000      surat
1   3   krish  hr   6200     bombay
2   5   radha  it   5600  ahemdabad
3   6    kunj  hr   9000    navsari
4   7   radha  it  11000      delhi
5   8    kunj  hr   9000    navsari
6  11   jamna  hr   5000    bharuch
7  13    lila  hr  11000    vadodra
8  14     jal  it   7800       vapi
9  15  kinjal  it  20000      surat

In [72]:
q2="select * from employee6 order by dept"

In [73]:
cur.execute(q2)

In [74]:
pd.DataFrame(cur.fetchall())

     0        1          2      3          4
0    2   madhav    account   4000    bardoli
1   10     gopi    account   4000       vapi
2   12    kisha    account   3900  ahemdabad
3    3    krish         hr   6200     bombay
4    6     kunj         hr   9000    navsari
5    8     kunj         hr   9000    navsari
6   11    jamna         hr   5000    bharuch
7   13     lila         hr  11000    vadodra
8    4  krishna  inventory   7000    chennai
9    9  prathna  inventory   9900   bilimora
10   1   keshav         it   6000      surat
11   5    radha         it   5600  ahemdabad
12   7    radha         it  11000      delhi
13  14      jal         it   7800       vapi
14  15   kinjal         it  20000      surat

In [75]:
q3="select * from employee6 where basic>6000"

In [76]:
cur.execute(q3)

In [77]:
pd.DataFrame(cur.fetchall())

    0        1          2      3         4
0   3    krish         hr   6200    bombay
1   4  krishna  inventory   7000   chennai
2   6     kunj         hr   9000   navsari
3   7    radha         it  11000     delhi
4   8     kunj         hr   9000   navsari
5   9  prathna  inventory   9900  bilimora
6  13     lila         hr  11000   vadodra
7  14      jal         it   7800      vapi
8  15   kinjal         it  20000     surat

In [81]:
q4="select * from employee6 where name LIKE '_r%'"

In [82]:
cur.execute(q4)

In [83]:
pd.DataFrame(cur.fetchall())

   0        1          2     3         4
0  3    krish         hr  6200    bombay
1  4  krishna  inventory  7000   chennai
2  9  prathna  inventory  9900  bilimora

In [85]:
conn.commit()

In [88]:
q6="select dept ,count(*)from employee6 group by dept having dept IN('account','inventory')"

In [89]:
cur.execute(q6)

In [90]:
pd.DataFrame(cur.fetchall())

           0  1
0    account  3
1  inventory  2

In [92]:
conn.commit()

In [95]:
q7="select * from employee6 order by branch DESC"

In [96]:
cur.execute(q7)

In [97]:
pd.DataFrame(cur.fetchall())

     0        1          2      3          4
0   10     gopi    account   4000       vapi
1   14      jal         it   7800       vapi
2   13     lila         hr  11000    vadodra
3    1   keshav         it   6000      surat
4   15   kinjal         it  20000      surat
5    6     kunj         hr   9000    navsari
6    8     kunj         hr   9000    navsari
7    7    radha         it  11000      delhi
8    4  krishna  inventory   7000    chennai
9    3    krish         hr   6200     bombay
10   9  prathna  inventory   9900   bilimora
11  11    jamna         hr   5000    bharuch
12   2   madhav    account   4000    bardoli
13   5    radha         it   5600  ahemdabad
14  12    kisha    account   3900  ahemdabad

In [99]:
conn.commit()

In [100]:
conn.close()